* Question
Implement a new special form `ramb` that is like `amb` except that it searches alternatives in a random order, rather than from left to right. Show how this can help with Alyssa's problem in exercise 4.49.

* Answer
** Implementation
:PROPERTIES:
:header-args:scheme: :eval no
:END:
#+begin_src scheme :tangle 4.50.ambeval.eval.ramb.scm
  (define (install-ramb-package)
    (put 'eval 'ramb
         (lambda (exp)
           (let ((cprocs (map analyze (amb-choices exp))))
             (lambda (env succeed fail)
               (let try-next ((choices (shuffle cprocs))) ;; Changed
                 (if (null? choices)
                     (fail)
                     ((car choices) env
                      succeed
                      (lambda ()
                        (try-next (cdr choices))))))))))
    'ok)

  (define (install-ramb-extras)
    (mc-eval
     '(define (random-element items)
        (require (not (null? items)))
        (ramb (car items)
              (random-element (cdr items)))))
    'ok)
#+end_src

#+begin_src scheme :tangle 4.50.ambeval.scm
  ;; Util
  (load "0.efma.scm")
  ;; Inherit
  (load "4.ambeval.scm")
  ;; Expression types
  (load "4.50.ambeval.eval.ramb.scm")
  ;; Setup
  (install-ramb-package)
  (install-ramb-extras)
#+end_src

#+begin_src scheme :tangle 4.50.ambeval.extra.grammar.generate.scm
  (mc-eval
   '(define (parse-word word-list)
      (list (car word-list)
            (random-element (cdr word-list))))) ;; Changed
#+end_src

** Test
#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.50.ambeval.scm")
  (load "4.ambeval.extra.grammar.scm")
  (load "4.50.ambeval.extra.grammar.generate.scm")
  ;; Test
  (set! mc-eval-depth 6)
  (map (lambda (x)
         (pp x)
         (newline))
       (mc-eval '(parse-sentence)))
#+end_src

#+RESULTS:
#+begin_example
(sentence (simple-noun-phrase (article a) (noun professor)) (verb studies))

(sentence
 (simple-noun-phrase (article a) (noun professor))
 (verb-phrase
  (verb studies)
  (prep-phrase (prep in) (simple-noun-phrase (article the) (noun class)))))

(sentence
 (simple-noun-phrase (article a) (noun professor))
 (verb-phrase
  (verb-phrase
   (verb studies)
   (prep-phrase (prep in) (simple-noun-phrase (article the) (noun class))))
  (prep-phrase (prep for) (simple-noun-phrase (article the) (noun cat)))))

(sentence
 (simple-noun-phrase (article a) (noun professor))
 (verb-phrase
  (verb-phrase
   (verb-phrase
    (verb studies)
    (prep-phrase (prep in) (simple-noun-phrase (article the) (noun class))))
   (prep-phrase (prep for) (simple-noun-phrase (article the) (noun cat))))
  (prep-phrase (prep by) (simple-noun-phrase (article the) (noun class)))))

(sentence
 (simple-noun-phrase (article a) (noun professor))
 (verb-phrase
  (verb-phrase
   (verb-phrase
    (verb-phrase
     (verb studies)
     (prep-phrase (prep in) (simple-noun-phrase (article the) (noun class))))
    (prep-phrase (prep for) (simple-noun-phrase (article the) (noun cat))))
   (prep-phrase (prep by) (simple-noun-phrase (article the) (noun class))))
  (prep-phrase (prep for) (simple-noun-phrase (article a) (noun student)))))

(sentence
 (simple-noun-phrase (article a) (noun professor))
 (verb-phrase
  (verb-phrase
   (verb-phrase
    (verb-phrase
     (verb-phrase
      (verb studies)
      (prep-phrase (prep in) (simple-noun-phrase (article the) (noun class))))
     (prep-phrase (prep for) (simple-noun-phrase (article the) (noun cat))))
    (prep-phrase (prep by) (simple-noun-phrase (article the) (noun class))))
   (prep-phrase (prep for) (simple-noun-phrase (article a) (noun student))))
  (prep-phrase (prep for) (simple-noun-phrase (article a) (noun student)))))

...

#+end_example
